Tekla Open API Reference for Tekla Structures 2025
Polycurve.Equals Method
 Determines whether the polycurve equals another polycurve This function only checks for equality among polycurves
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	ICurve other
)
Public Function Equals (
	other As ICurve
) As Boolean
Parameters
other
Type: Tekla.Structures.Geometry3d.ICurve
The other polycurve
Return Value
Type: Boolean
True if equal, false otherwise
Implements
IEquatable<T>.Equals(T)
See Also
Reference
Polycurve Class
Tekla.Structures.Geometry3d Namespace